auth = "xffmaicbkrrlofhuysquscwmenjpriai"
guidgap = "g0BbWVQ04efc221bc358b350870b9808"
Linkgap = "https://rubika.ir/joing/CCBAADBG0BZYVHQELOHZBKNSBBUWNWPO"
GUIDECHANEL = "c0BHMrc045e43034698bc7bd5d55bb1a"
import requests
import json
import random as rn
    


STARTBOT2 = """
.🌞💛. ران‍‌ش‍‌دم‍‌ م‍‌ی‍‌ت‍‌وان‍‌ی‍‌د ب‍‌ا ف‍‌رس‍‌ت‍‌ادن ک‍‌لم‍‌ه ه‍‌ای [راه‍‌ن‍‌م‍‌ا] و [دس‍‌ت‍‌ورات] از [زرن‍‌ی‍‌ا ب‍‌ات ه‍‌وش‍‌م‍‌ن‌‌د] اس‍‌ت‍‌ف‍‌اده ک‍‌ن‍‌ی‍‌د ش‍‌روع ف‍‌ع‍‌ال‍‌ی‍‌ت در گ‍‌پ ' 'ب‍‌ات‍‌ | چ‍‌ت '🌝🤍' . . . . . .
"""  
PAYAMADD = """
🗞️📒 ᴍᴇᴍBᴇʀ 𝑗𝑜𝑖𝑛 GApE ک‍‌ه ج‍‌ی‍‌ن‍‌دا 
"""
captionwelcome = f"""
#𝒘𝒆𝒍𝒄𝒐𝒎𝒆!  ج‍‌ی‍‌ن‍‌دا •🌚💛• 
 • ب‍‌ه گ‍‌پ '  خ‍‌وش‍ آم‍‌دی •🧸📒•️ 
ل‍‌ط‍‌ف ک‍‌ن #ق‍‌وان‍‌ی‍‌ن! رو رع‍‌ای‍‌ت ک‍‌ن .
ک‍‌ل‍‌م‍‌ه ه‍‌ای <راه‍‌ن‍‌م‍‌ا> و <دس‍‌ت‍‌ورات> رو ب‍‌ف‍‌ر‍س‍‌ت‍‌ #ک‍‌ارام‍‌و🫂💙 ||ب‍‌ب‍‌ی‍‌ن||

 .🗞𖦹.️ ب‍‌رای م‍‌ش‍‌اه‍‌ده #ق‍‌وان‍‌ی‍‌ن |  ک‍‌اف‍‌ی‍‌ه ک‍‌ل‍‌م‍‌ه <ق‍‌وان‍‌ی‍‌ن> رو ارس‍‌ال ک‍‌ن‍‌ی!


"""
kanaloruser = "botnull"
captionstart = """
زرن‍‌ی‍‌ا ب‍‌ات [ه‍‌وش‍‌م‍‌ن‍‌د] ' 'ب‍‌ات‍‌ | چ‍‌ت '🌝🤍' 
ب‍‌ام‍‌وف‍‌ق‍‌ی‍‌ت
 [اس‍‌ت‍‌ارت]ش‍‌د🥺📒
"""
postbetar = """
ال‍‌ان پس‍‌ت‍‌و م‍‌ی‍‌زارم‍ ت‍‌و چ‍‌ن‍‌ل .🤍🌝.
"""
tarkgap = f"""
ب‍‌ک‍ُ‌س دخ‍‌ت‍‌رای گ‍‌پ زودت‍‌ر م‍‌ی‍‌رفت‍‌ی •👋🏿🪣️•
"""
ghoflgap = """
🔒🗿 | گ‍‌پ ق‍‌ف‍‌ل ش‍‌د
"""
bazgap = """
🔓🗿 | گ‍‌پ ب‍‌از ش‍‌د
"""
alertadmin = """
شما ادمین شدید
"""
alertwelcome = """
سلام خوش اومدید
"""
bazkardangap = """
گروه باز شد و فلان
"""
alertremove = """
مثلا کاربر ریم شد و فلان
"""
alertstart = """
ربات فعال شد
"""
alertstop = """
ربات خاموش شد
"""
helpbotnull = f"""
آپدیت راهنما
.📒💛.ب‍‌گ‍‌ی‍ ق‍‌ف‍‌ل ‍ق‍‌ف‍‌ل م‍‌ی‍‌ک‍‌ن‍‌ه گ‍‌پ‍و . !
.📒💛.ب‍‌گ‍‌ی ب‍‌ا‍ز ک‍‌ردن ب‍‌ا‍ز م‍‌ی‍‌ک‍‌ن‍‌ه گ‍‌پ‍و . !
.📒💛.ب‍‌ر‍‌د‍ا‍ش‍‌ت‍‌ن ح‌‍ا‍ل‍‌ت ارام‍‌ . !
.📒💛.رو ط‍‌ر‌‍ف ری‍‌پ ‍ب‍‌ز‍ن ب‍‌گ‍و اخ‌‍ط‍‌ار . !
.📒💛.رو پ‍‌ی‍‌ا‍م‍ ری‌‍پ ب‍‌زن ب‍‌گ‍‌و س‍‌ن‍‌ج‍‌ا‍ق‍ . !
.📒💛.ب‍‌ر‍داش‍‌ت‍‌ن س‌‌ن‍‌ج‍‌اق‍ . !
.📒💛.ری‍‌پ ب‍‌زن ب‍‌گ‍و ح‌‍ذف‍ . !
.📒💛.ر‍‌ی‍‌پ ب‍‌زن رو پ‍‌ی‍‌ا‍م‍ ط‍‌رف ب‍‌گ‍‌و ری‍‌م ی‍‌ا صیک ی‍‌ا ب‍‌ن ی‍‌ا
ری‍‌م @{kanaloruser} . !
.📒💛.بب‍‌ن‍‌وی‍‌س افزودن @{kanaloruser} . !
.📒💛.ب‍‌ن‍‌وی‍‌س ی‍‌ا فونت !FONT ک‍‌ن‍‌ا‍رش‍ اس‍‌م‍‌ت م‍‌ث‍ال‍ : !FONT NULL . !
@{kanaloruser} . !
.📒💛.اگ‍‌ه م‍‌ی‍‌خ‍‌ای چی‍‌ز‍ی‍‌و ت‍‌ک‍‌ر‍ار ک‍‌ن‍‌ه  م‍‌ت‍‌ن رو بده و ک‍‌ل‍‌م‍‌ه ب‍‌گ‍‌و رو مثلا بگو سلام بن‍‌وی‍‌س .!
.📒💛.اگ‍‌ه م‍‌ی‍‌خ‍‌ای ح‌‌ا‍ل‍‌ت ارام‍ ف‍‌ع‍‌ال ش‍‌ه ب‍‌ن‍‌و‍ی‍‌س : 
ح‍‌ا‍ل‍‌ت آرام‍ ⁵ یا ¹⁰ و . . . !
.📒💛.اگ‍‌ه م‍‌ی‍‌خ‍‌ای ک‍‌س‍‌ی اد‍م‍‌ی‍‌ن ش‍‌ه یا ح‍‌ذف‍ ادم‍‌ی‍‌ن ش‍‌ه رو ط‍‌ر‍ف‍‌ ری‍‌پ ب‍‌زن ب‍‌ن‍وی‍‌س :
ارت‍‌قا یا ت‍‌ن‍‌ز‍ی‍‌ل . !
.📒💛.اگ‍‌ه م‍‌ی‍‌خ‍‌ای ک‍‌س‍‌ی‍‌و ب‍‌ررس‍‌ی ک‍‌ن‍‌ی ط‍ گ‍‌پ رو ط‍‌رف‍ ری‍‌پ ب‍‌زن ب‍‌ن‍‌وی‍‌س :
ب‍‌ر‍س‍‌ی . !
.📒💛.اگ‍‌ه م‍‌ی‍‌خ‍‌ای مش‍‌خ‍‌ص‍‌ات‍ ط‍‌ر‍ف‍‌و ب‍‌گ‍‌ه ب‍‌ن‍‌و‍ی‍‌س
!info @{kanaloruser} یا روش ریپ میزنی . !
.📒💛.اگ‍‌ه م‍‌ی‍‌خ‍‌ای ک‍‌س‍‌ی‍و ا‍ز ل‍‌ی‍‌س‍‌ت س‍‌ی‍‌اه ح‌‌ذف‍ ک‍‌ن‍ی ب‍‌ن‍‌وی‍‌س : 
ا‍ز‍ا‍د @{kanaloruser} . !
.📒💛.ب‍‌ر‍ای ای‍‌ج‌‌اد ک‍‌ال  ب‍‌ن‍‌وی‍‌س :
ای‍‌ج‍‌اد ک‍‌ال  . !
.📒💛.چ‍‌ی‍‌ز‍‌ه‍‌ا‍ی‍‌ی ک‍‌ه ج ‍‌م‍‌ی‍‌ده : ب‍‌اط ر‍‌ب‍‌اط ر‍‌ب‍‌ات‍ ب‍‌ا‍ت‍ . !
.📒💛.چ‍‌ی‍‌ز‍‌ه‍‌ا‍ی‍‌ی ک‍‌ه ج ‍‌م‍‌ی‍‌ده : ‍خ‍‌ب‍‌ی ت‍‌و . !
.📒💛.چ‍‌ی‍‌ز‍‌ه‍‌ا‍ی‍‌ی ک‍‌ه ج ‍‌م‍‌ی‍‌ده : گ‍‌ل‍‌ش‍‌ی‍‌ف‍‌ت‍‌ه اص‍‌ل ب‍‌ده . !
.📒💛.چ‍‌ی‍‌ز‍‌ه‍‌ا‍ی‍‌ی ک‍‌ه ج ‍‌م‍‌ی‍‌ده : گ‍‌ل‍‌ش‍‌ی‍‌ف‍‌ت‍‌ه خ‍‌ودت‍‌و م‍‌ع‍‌رف‍‌ی ک‍‌ن . !
.📒💛.‍‌چ‍‌ی‍‌زه‍‌ای‍‌ی ک‍‌ه ج ‍‌م‍‌ی‍‌ده :برلیم یا رولیم . !
.📒💛.‍‌چ‍‌ی‍‌زه‍‌ای‍‌ی ک‍‌ه ج ‍‌م‍‌ی‍‌ده : سازندت کیه یا کی تورو ساخته . !
.📒💛.چ‍‌ی‍‌ز‍‌ه‍‌ا‍ی‍‌ی ک‍‌ه ج ‍‌م‍‌ی‍‌ده : ساعت . !
.📒💛.چ‍‌ی‍‌ز‍‌ه‍‌ا‍ی‍‌ی ک‍‌ه ج ‍‌م‍‌ی‍‌ده : گاد . ! 
.📒💛.چ‍‌ی‍‌ز‍‌ه‍‌ا‍ی‍‌ی ک‍‌ه ج ‍‌م‍‌ی‍‌ده : بپرس به صورت رندوم . !
.📒💛.چ‍‌ی‍‌ز‍‌ه‍‌ا‍ی‍‌ی ک‍‌ه ج ‍‌م‍‌ی‍‌ده : اخطار میده  . !
.📒💛.‍‌چ‍‌ی‍‌زه‍‌ای‍‌ی ک‍‌ه ج ‍‌م‍‌ی‍‌ده : هایا . !
.📒💛.‍‌چ‍‌ی‍‌زه‍‌ای‍‌ی‌ ک‍‌ه ج ‍‌م‍‌ی‍‌ده : هعی !
.📒💛.‍‌چ‍‌ی‍‌زه‍‌ای‍‌ی ک‍‌ه ج ‍‌م‍‌ی‍‌ده : کیر خر . !
.📒💛.چ‍‌ی‍‌ز‍‌ه‍‌ا‍ی‍‌ی ک‍‌ه ج ‍‌م‍‌ی‍‌ده : ج‍‌وک . !
.📒💛.چ‍‌ی‍‌ز‍‌ه‍‌ا‍ی‍‌ی ک‍‌ه ج ‍‌م‍‌ی‍‌ده : داس‍‌ت‍‌ان . !
.📒💛.چ‍‌ی‍‌ز‍‌ه‍‌ا‍ی‍‌ی ک‍‌ه ج ‍‌م‍‌ی‍‌ده : ذ‍ک‍‌ر . !
.📒💛.چ‍‌ی‍‌ز‍‌ه‍‌ا‍ی‍‌ی ک‍‌ه ج ‍‌م‍‌ی‍‌ده : دان‍‌س‍‌ت‍‌ن‍‌ی . !
.📒💛.‍‌ی‍‌ز‍‌ه‍‌ا‍ی‍‌ی ک‍‌ه ج ‍‌م‍‌ی‍‌ده : ب‍‌ی‍‌و . !
.📒💛.چ‍‌ی‍‌ز‍‌ه‍‌ا‍ی‍‌ی ک‍‌ه ج ‍‌م‍‌ی‍‌ده : م‍ث‍‌ل‍‌ا ال‍‌ک‍‌ی . !
.📒💛.چ‍‌ی‍‌ز‍‌ه‍‌ا‍ی‍‌ی ک‍‌ه ج ‍‌م‍‌ی‍‌ده : پ‍‌ ن‍ پ‍‌ . !
.📒💛.چ‍‌ی‍‌ز‍‌ه‍‌ا‍ی‍‌ی ک‍‌ه ج ‍‌م‍‌ی‍‌ده : دی‍‌ال‍‌وگ‍ . !
.📒💛.چ‍‌ی‍‌ز‍‌ه‍‌ا‍ی‍‌ی ک‍‌ه ج ‍‌م‍‌ی‍‌ده : ح‍دی‍‌ث . !
.📒💛.چ‍‌ی‍‌ز‍‌ه‍‌ا‍ی‍‌ی ک‍‌ه ج ‍‌م‍‌ی‍‌ده : زم‍‌ان‍ . !
.📒💛.چ‍‌ی‍‌ز‍‌ه‍‌ا‍ی‍‌ی ک‍‌ه ج ‍‌م‍‌ی‍‌ده : ل‌‌ی‍‌ن‍‌ک . !
.📒💛.چ‍‌ی‍‌ز‍‌ه‍‌ا‍ی‍‌ی ک‍‌ه ج ‍‌م‍‌ی‍‌ده : ق‍‌و‍ا‍‌ن‍‌ی‍‌ن . !
.📒💛.چ‍‌ی‍‌ز‍‌ه‍‌ا‍ی‍‌ی ک‍‌ه ج ‍‌م‍‌ی‍‌ده : راه‍‌ن‍‌م‍‌ا . !
.📒💛.چ‍‌ی‍‌ز‍‌ه‍‌ا‍ی‍‌ی ک‍‌ه ج ‍‌م‍‌ی‍‌ده : د‍‌س‍‌ت‍‌و‍ر‍ا‍‌ت‍ . !
.📒💛.چ‍‌ی‍‌ز‍‌ه‍‌ا‍ی‍‌ی ک‍‌ه ج ‍‌م‍‌ی‍‌ده : پس‍‌ورد . !
.📒💛.چ‍‌ی‍‌ز‍‌ه‍‌ا‍ی‍‌ی ک‍‌ه ج ‍‌م‍‌ی‍‌ده : font! . !
.📒💛.چ‍‌ی‍‌ز‍‌ه‍‌ا‍ی‍‌ی ک‍‌ه ج ‍‌م‍‌ی‍‌ده : ربات . ! 
.📒💛.چ‍‌ی‍‌ز‍‌ه‍‌ا‍ی‍‌ی ک‍‌ه ج ‍‌م‍‌ی‍‌ده ای‍‌م‍‌وج‍‌ی : 😭-😐-☹️-😕-🙁😡-🤬-😎-😍-😘-😏-😁-😜-😋-🤪-😜-😝-🙏-🖕 . !
 .📒💛.چ‍‌ی‍‌ز‍‌ه‍‌ا‍ی‍‌ی ک‍‌ه ج ‍‌م‍‌ی‍‌ده : س‍‌ل‍‌ام‍‌-خ‍‌ب‍‌ی-ار‍ه-ن‍‌ه-اس‍‌ت‍‌ق‍‌ل‍‌ا-پ‍‌رس‍‌پ‍‌‍ول‍‌ی‍‌س-راس‍‌ت م‍‌ی‍‌گ‍‌ی-ب‍‌ای-خ‍‌داح‍‌ا‍فـ‍‌ظ-ل‍‌ف-م‍‌ن‍ ام‍‌د‌م-م‍‌ن آم‍‌د- برسی-عشق من کیه- بوس بده-بوسم کن-عجب- سینگلم-با  من  ازدواج میکنی- اصل- اثل-رل -دوست دارم -فدات-فداتم-خر- گاو-الاغ-خوش-خوشم- هعی-فحش
داد-فهش داد-تایم-تولد-عید-پسورد . !
.📒💛.‍‌ج‍‌وی‍‌ن
ی‍‌ا چ‍‌ی . !
.📒💛. 𝐁𝐨𝐓 | @{kanaloruser} .✨💛.
"""

joratandhagigat = ["سوال اول جرعت و حقیقت","سوال دوم جرعت و حقیقت","سوال سوم","سوال چهارم","سوال پنجم"]
postgozar = """
پ‍‌س‍‌د گ‍‌زاری‍‌ ت‍‌وس‍‌ط‍‌ رب‍‌ات‍‌ ه‍‌وش‍‌م‍‌ن‍‌د [ب‍‌ن‍‌ی]
ل‍‌ی‍‌ن‍‌ک‍‌ چ‍‌ن‍‌ل ج‍‌وی‍‌ن'🌝🤍'
- | @BLOW_JUB ||🫂💙.
"""

haya = """ک‍‌س‍‌ ن‍‌ن‍‌ت #ب‍‌ه ک‍‌ی‍‌ر‍م‍ ه‍‌ا‍ی‍‌ا🗿🤝🏻"""

captionzarniya = """
⛑️
🤒
👔🌻
👖🖱 
"""

javaberbot = """| اس‍‌م‍‌م‍‌ رب‍‌ات‍‌ ن‍‌ی‍‌س ح‍‌ی‍‌و‍‌ن‍‌ م‍‌ن‍‌ دخ‍‌م‍‌ل ب‍‌ان‍‌و زه‍‌را و‌ ب‍‌ن‍‌ی‍‌م ص‍‌ی‍‌دام‍ ک‍‌ون زرن‍‌ی‍‌ا
 ج‍‌واب‍‌ت‍‌و ب‍‌دم .🌝🤍💋: ف‍‌م‍‌ی‍‌دی ی‍‌ا #ب‍‌ف‍‌ه‍‌م‍‌ون‍‌م‍‌ت ک‍‌س‍‌و؟ '💙🫂' /zarneya
"""

javabseyed = """
ای‍‌ن ی‍‌ک ع‍‌دد ای‍‌م‍‌وج‍‌ی م‍‌ی‍‌ب‍‌اش‍‌د ٫ ک‍‌ه ج‍‌دی‍‌دن چ‍‌س‍‌ا و ک‍‌س‍‌ان‍‌ی ک‍‌ه م‍‌ث‍‌ل‍‌ا ش‍‌اق‍‌ن ت‍‌و ه‍‌ر تک‍‌س‍‌ش‍‌ون ی‍‌ک‍‌ی م‍‌ی‍‌دن #م‍‌ث‍‌ توع‍‌ه چ‍‌س‍‌خ‍‌ل ک‍‌وس‍‌ه خ‍‌ار ||🫂🗿||
"""

javablink = """
- .🧡🗿'
- || ج‍‌وی‍‌ن ب‍‌اش‍‌ی‍‌ن‌.👆🏻🙁'
- Gap ||  .🗿💚'
- || ج‍‌وی‍‌ن ب‍‌اش‍‌ی‍‌ن‌.👆🏻🙁'
- pV || @ .🗿💙'
- || ج‍‌وی‍‌ن ب‍‌اش‍‌ی‍‌ن‌.👆🏻🙁'
گ‍‌درت‍‌ دس‍‌ت‍‌ه ن‍‌ف‍‌رای‍‌م #ب‍‌ن‍‌ی‍‌ه ار ب‍‌ای'🫂🌝'
"""

gavanin = """
متن قوانین
"""

jerandarr = """
پاره نشی😏
"""
areeee = """
جواب اره
"""
azadban = """
|🌚💛| ی‍‌ک ج‍‌ی‍‌ندا آزاد ش‍‌د •
"""

startcal = """
با موفقیت کال ایجاد شد
"""

khobi = """
ج‍‌ی‍‌ن‍‌دا ع‍‌اول‍‌ی‍‌م ت‍‌و چی‍‌دوری‍ •🌚💛•
"""


golshifte = """
من گلشیفته هستم اهل تهران
 17 سالمه خدمت گذار شما و روبیکا هستم"""
 

berel = """
ن‍‌ن‍‌ت ک‍‌ی‍‌س م‍‌ون‍‌اس‍‌ب‍‌ی ب‍‌رای #ک‍‌ردن اس‍‌ت | 🫂💛
"""

sazande = """
سازنده من نوله
"""

heay = """
روزگ‍‌ار ن‍‌ازن‍‌ی‍‌ن #ت‍‌ف💦 ب‍‌زن‍‌م ی‍‌ا #وازل‍‌ی‍‌ن🗿🫂
"""